/*
 Localizable.strings
 Video-A-Day
 
 
 Created by Andrew Apperley on 1/9/2014.
 Copyright (c) 2014 AFApps. All rights reserved.
 */


/** Offline failure strings */
"AFBlipOfflineLaunchErrorMessage"               = "Your data connection appears to be offline.";

/** API Failure strings */
//Video Responses
"kServerVideoAlreadyExistsError"                = "Video already exists!";
"kServerVideoFutureVideoError"                  = "Cannot create future videos!";
"kServerVideoBefore1900Error"                   = "Cannot create a video for years before 1900!";
"kServerVideoTimelineIDDoesntExist"             = "Timeline doesn't exist!";
"kServerVideoIssueMakingVideo"                  = "Issue saving the video, please try again.";
"kServerVideoCreatedVideoSuccess"               = "Video created successfully!";
"kServerVideoVideosForPage"                     = "Videos for page.";
"kServerVideoAlreadyFavourited"                 = "Video is already favourited.";
"kServerVideoFavouritingError"                  = "There was an issue setting the video as a favourite, please try again.";
"kServerVideoFavouritedSuccess"                 = "Video favourited successfully!";
"kServerVideoNotFavourited"                     = "Video is not favourited.";
"kServerFavouriteRemovedSuccess"                = "Video was removed from favourites successfully.";
"kServerVideoUserHasNoFavourites"               = "You have favourites!";
"kServerVideoTimelineCreationError"             = "There was an issue creating the timeline, try again.";
"kServerVideoTimelineCreationSuccess"           = "Timeline created successfully!";
"kServerVideoTimelineList"                      = "Timeline list for user.";
"AFBlipTimelineErrorNoVideosFound"              = "No Blips found. Please check your data connection.";

//User responses
"kServerUserCreationError"                      = "There was an issue creating your account, please try again.";
"kServerUserAlreadyExistsError"                 = "That email is already in use, please try again.";
"kServerUserSignUpSuccess"                      = "Thank you for signing up!";
"kServerUserNotFoundError"                      = "User not found.";
"kServerUserInfoResponseSuccess"                = "User information.";
"kServerUserInfoUpdatedSuccess"                 = "User information updated.";
"kServerUserAlreadyDeactivatedError"            = "This account has already been deactivated.";
"kServerUserDeactivatedSuccess"                 = "Your account has been deactivated.";
"kServerUserUpdateNoInfoToUpdateError"          = "No new information to update.";
"kServerUserTokenUpdatedSuccess"                = "Users token updated successfully!";
"kServerUserUsernameAvailableSuccess"           = "You are able to use that email address.";
"kServerUserUsernameAvailableError"             = "That email is currently in use.";
"kServerUserLoggedOutSuccess"                   = "You have logged out successfully.";
"kServerUserLoggedOutError"                     = "There was an error logging you out.";
"kServerUserLoggedInSuccess"                    = "You have logged in successfully!";
"kServerUserLoggedInError"                      = "Incorrect login information, please try again.";
"kServerUserConnectionRequestSentSuccess"       = "Your friend request has been sent!";
"kServerUserConnectionRequestSentError"         = "Issue creating a friendship, please try again.";
"kServerUserAcceptConnectionRequestError"       = "There was an error changing the status.";
"kServerUserAcceptConnectionRequestSuccess"     = "You have successfully changed the status for the friendship";
"kServerUserConnectionListSuccess"              = "Friend list success.";
"kServerUserConnectionListError"                = "There was an error retrieving the friend list, try again.";
"kServerUserLimitedProfileSuccess"              = "Limited profile for user.";
"kServerUserLimitedProfileError"                = "There was an error retrieving the limited profile, try again.";
"kServerUserSearchResponse"                     = "Search results.";
"kServerVideoTimelineIDsForUser"                = "Timeline list for user";
"kServerVideoTimelineIDsForUserFailure"         = "Timeline list for user failed to load";
"kServerUserConnectionRequestExistsError"       = "This friend request has already been sent!";
"kServerUserConnectionRemoveProfileSuccess"     = "You have successfully removed a friend!";
"kServerUserConnectionRemoveProfileFailure"     = "Something went wrong trying to remove your friend!";
"kServerDeactivatedNotAuthorizedError"          = "The password you entered didn't match the one we have in our systems, please try again.";
"kServerUserAlreadyDeactivatedError"            = "That account is already deactivated, please contact us if you believe this was done without your permission.";
"kServerUserDeactivatedSuccess"                 = "Your account was deactivated. We hope you choose to come back to Blips in the future.";
"kServerUserPasswordResetUserDoesNotExistRequestError" = "That user doesn't exist.";
"kServerUserPasswordResetRequestAlreadyPresent" = "That user has already requested their password to be reset, please check your email for a confirmation.";
"kServerUserPasswordRequestSentSuccess"         = "Your password was reset successfully. Please check your email account for a confirmation email and instructions on how to pick a new password.";

/** Initial view */
"AFBlipInitialViewCreating"                     = "creating memories, one blip at a time";
"AFBlipInitialViewSignUp"                       = "Sign Up";
"AFBlipInitialViewSignIn"                       = "Sign In";
"AFBlipInitialViewImageSource"                  = "Set profile image";
"AFBlipInitialViewImageSourceAlbumType"         = "Choose existing photo";
"AFBlipInitialViewImageSourceCameraType"        = "Take a photo";

/** Signup form view */
"AFBlipSignupFormDisplayName"                   = "Name";
"AFBlipSignupFormPassword"                      = "Password";
"AFBlipSignupFormEmail"                         = "Email";
"AFBlipSignupFormSubmitButton"                  = "Submit";
"AFBlipSignupFormTerms"                         = "By signing up you agree to our Terms and Conditions";
"AFBlipSignupFormTermsColoredStrings"           = "Terms and Conditions";
"AFBlipSigninForFailureTitle"                   = "Oops!";
"AFBlipSignupForFailureTitle"                   = "Uh Oh!";
"AFBlipSignupForFailureTitleUsernameTaken"      = "We couldn't sign you up!";
"AFBlipSigninForFailureButtonTitle"             = "Okay";

"AFBlipSignupErrorUsernameTakenAppendage"       = "It looks like %@ has already been registered!";
"AFBlipSignupProfileImagePickerAlertTitle"      = "Oops!";
"AFBlipSignupProfileImagePickerAlertMessage"    = "You didn't set a profile picture. Would you like to set one up now?";
"AFBlipSignupProfileImagePickerAlertYes"        = "Yes";
"AFBlipSignupProfileImagePickerAlertNo"         = "No, I will later";

/** Settings menu */
"AFBlipSettingsMenuEditProfile"                 = "Edit Profile";
"AFBlipSettingsMenuHelp"                        = "Help & FAQ";
"AFBlipSettingsMenuFeedback"                    = "Feedback";
"AFBlipSettingsMenuLogout"                      = "Log Out";

/** Log out alert view */
"AFBlipSettingsMenuLogoutAlertTitle"            = "Blips";
"AFBlipSettingsMenuLogoutAlertMessage"          = "Are you sure you want to log out?";
"AFBlipSettingsMenuLogoutAlertMessageFailure"   = "Failed to log out.";
"AFBlipSettingsMenuLogoutAlertYes"              = "Yes";
"AFBlipSettingsMenuLogoutAlertNo"               = "No";

/** Connections List */
"AFBlipConnectionsRecentBlips"                  = "Recent Blips";
"AFBlipConnectionsFavouriteBlips"               = "Favourite Blips";
"AFBlipConnectionsPersonalBlips"                = "Personal";
"AFBlipConnectionsConnectionsBlips"             = "Friends";
"AFBlipConnectionsConnectionsRequests"          = "Friend Requests";
"AFBlipConnectionsConnectionsSearch"            = "Search for friends";
"AFBlipConnectionsSearchResultsBlips"           = "Search Results";
"AFBlipConnectionAddingForFailureTitle"         = "Add Friend";

/** Connections Profile */
"AFBlipConnectionsProfileViewTitle"             = "Friend Profile";

/** Limited Profile */
"AFBlipLimitedProfileButtonText"                = "+   Add Friend";
"AFBlipLimitedProfileAlertTitle"                = "User Profile";

/** Edit Profile */
"AFBlipEditProfileTitle"                        = "Edit Profile";
"AFBlipEditProfileRetryButtonTitle"             = "Retry";
"AFBlipEditProfilePasswordButtonPlaceholder"    = "........";
"AFBlipEditProfileEditButtonTitle"              = "Edit";
"AFBlipEditProfileCancelButtonTitle"            = "Cancel";
"AFBlipEditProfileSaveButtonTitle"              = "Save";
"AFBlipEditProfileFiltersButtonTitle"           = "Additional Filters";
"AFBlipEditProfileDeactivateButtonTitle"        = "Deactivate";
"AFBlipEditProfileNotificationsTitle"           = "Push Notifications";
"AFBlipEditProfileDeactivateTitle"              = "Deactivate Account";
"AFBlipEditProfileDeactivateMessage"            = "Enter your password below if you wish to deactivate your account.";
"AFBlipEditProfileDeactivateAlertYes"           = "Deactivate";
"AFBlipEditProfileDeactivateAlertNo"            = "Cancel";

/** Purchasing Filters */
"AFBlipAdditionalFiltersTitle"                  = "Purchasing Filters";
"AFBlipAdditionalFiltersMessage"                = "Your new filters have been downloaded to this device.";
"AFBlipAdditionalFiltersRestoringTitle"         = "Restoring Filters";
"AFBlipAdditionalFiltersRestoringMessage"       = "Your additional filters have been restored to this device.";
"AFBlipAdditionalFiltersCancelButtonTitle"      = "Cancel";
"AFBlipAdditionalFiltersSubmitButtonTitle"      = "Buy $%.2f";
"AFBlipAdditionalFiltersRestoreButtonTitle"     = "Restore Filter Purchase";

/** Friend Request Modal */
"AFBlipFriendRequestModalTitleRequest"    = "New friend request!";
"AFBlipFriendRequestModalTitleConfirm"    = "You have a new friend!";
"AFBlipFriendRequestModalTitleNewVideo"   = "A friend sent you a Blip!";
"AFBlipFriendRequestModalButtonAccept"    = "Accept";
"AFBlipFriendRequestModalButtonDecline"   = "Decline";
"AFBlipFriendRequestModalButtonPostVideo" = "Post a Blip";
"AFBlipFriendRequestModalButtonDismiss"   = "Dismiss";
"AFBlipFriendRequestModalButtonWatch"     = "Watch";

/** FAQ Modal */
"AFBLipFAQModalCancelButtonTitle" = "Done";
"AFBLipFAQModalNavigationTitle"   = "Help & FAQ";
"AFBLipFAQModalQuestionQ"         = "Q:";
"AFBLipFAQModalQuestion0"         = "What's a blip?";
"AFBLipFAQModalAnswer0"           = "Blips are small videos that you can share between you and a friend. You have the power to add filters to your blips to make viewing them even more of a pleasure. You can also favorite blips so you can easily go back and watch the ones you've enjoyed the most!";
"AFBLipFAQModalQuestion1"         = "How do I add a friend?";
"AFBLipFAQModalAnswer1"           = "You can add a friend by pressing the friend icon then typing in the search field. Results will show up underneath and adding a friend is as simple as pressing on their portrait.";
"AFBLipFAQModalQuestion2"         = "How do I create a blip?";
"AFBLipFAQModalAnswer2"           = "You can create a blip by pressing the video icon on the top right of your time line when you're viewing a friend. After recording your blip you can add a filter to add even more personality to your message!";
"AFBLipFAQModalQuestion3"         = "How do I delete a blip that I sent?";
"AFBLipFAQModalAnswer3"           = "You can delete a blip by pressing on blip's thumbnail and then pressing the trash can icon. Once you confirm your blip will be removed from our systems.";
"AFBLipFAQModalQuestion4"         = "How do I flag an inappropriate a blip?";
"AFBLipFAQModalAnswer4"           = "If you deem a blip that was sent to you inappropriate then please select the blip's thumbnail and then press the flag icon. Once we are notified, our system will remove the blip within twelve hours.";
"AFBLipFAQModalQuestion5"         = "I love the filters but I would like to have more options, do you offer more?";
"AFBLipFAQModalAnswer5"           = "Yes we do! On the filter screen when recording a video you can select the last option which will prompt you to purchase an additional filter pack which includes 10 extra filters.";
"AFBLipFAQModalQuestion6"         = "How do I restore my previously purchased filters?";
"AFBLipFAQModalAnswer6"           = "You can open the settings panel and press on the edit profile icon. From there you can select the Additional Filters button to restore them.";
"AFBLipFAQModalQuestion7"         = "How do I change my email?";
"AFBLipFAQModalAnswer7"           = "You can change your email or any of your other profile settings by pressing the menu icon then pressing the edit profile icon.";
"AFBLipFAQModalQuestion8"         = "I'm not enjoying my experience with Blips, how do I delete my account?";
"AFBLipFAQModalAnswer8"           = "We're sorry to hear that. :( If you haven't already we suggest submitting us some feedback so we can help you out. If you still would like to deactivate your account then you can press the menu icon and navigate to the the edit profile section. Here you can press the deactivate account button.";
"AFBLipFAQModalQuestion9"         = "Where can I send feedback about my Blips experience?";
"AFBLipFAQModalAnswer9"           = "You can open the settings panel and press on the feedback icon to send us your feedback, we would love to hear it!";

/** Terms Modal */
"AFBLipTermsModalNavigationTitle"   = "Terms & Conditions";
"AFBLipTermsModalNavigationTermsAndCondition" = "1. Terms\nBy accessing this application, you are agreeing to be bound by the application's Terms and Conditions of Use, all applicable laws and regulations, and agree that you are responsible for compliance with any applicable local laws. If you do not agree with any of these terms, you are prohibited from using or accessing this application.\n\n2. Use License\nPermission is granted to temporarily download one copy of the materials (information or software) on AF-Apps's Blips application for personal, non-commercial transitory use. This is the grant of a license, not a transfer of title, and under this license you may not: modify or copy the materials; use the materials for any commercial purpose, or for any public display (commercial or non-commercial); attempt to decompile or reverse engineer any software contained on Blips; remove any copyright or other proprietary notations from the materials; or transfer the materials to another person or \"mirror\" the materials without AF-App's written consent. This license shal automatically terminate if you violate any of these restrictions and may be terminated by AF-Apps at any time. Upon terminating your viewing of these materials or upon the termination of this license, you must destroy any downloaded materials in your possession whether in electronic or printed format.\n\n3. Disclaimer\nThe materials on Blips are provided \"as is\". AF-Apps makes no warranties, expressed or implied, and hereby disclaims and negates all other warranties, including without limitation, implied warranties or conditions of merchantability, fitness for a particular purpose, or non-infringement of intellectual property or other violation of rights. Further, AF-Apps does not warrant or make any representations concerning the accuracy, likely results, or reliability of the use of the materials on it's application or otherwise relating to such materials.\n\n4. Limitations\nIn no event shall AF-Apps be liable for any damages (including, without limitation, damages for loss of data or profit, or due to business interruption,) arising out of the use or inability to use the materials on Blips, even if AF-Apps or an AF-Apps authorized representative has been notified orally or in writing of the possibility of such damage. Because some jurisdictions do not allow limitations on implied warranties, or limitations of liability for consequential or incidental damages, these limitations may not apply to you.\n\n5. Revisions and Errata\nThe materials appearing on Blips could include technical, typographical, or photographic errors. AF-Apps does not warrant that any of the materials on it's Blips application are accurate, complete, or current. AF-Apps may make changes to the materials contained on Blips at any time without notice. AF-Apps does not, however, make any commitment to update the materials.\n\n6. Application Terms of Use Modifications\nAF-Apps may revise these terms of use for it's Blips application at any time without notice. By using this application you are agreeing to be bound by the then current versin of these Terms and Conditions of Use.\n\n7. Governing Law\nAny claim relating to AF-Apps's Blips application shall be governed by the laws of the Province of Ontario without regard to its conflict of law provisions.\n\n8. Privacy Policy\nYour privacy is very important to us. Accordingly, we have developed this Policy in order for you to understand how we collect, use, communicate and disclose and make use of personal information. The following outlines our privacy policy.Before or at the time of collecting personal information, we will identify the purposes for which information is being collected. We will collect and use of personal information solely with the objective of fulfilling those purposes specified by us and for other compatible purposes, unless we obtain the consent of the individual concerned or as required by law. We will only retain personal information as long as necessary for the fulfillment of those purposes. We will collect personal information by lawful and fair means and, where appropriate, with the knowledge or consent of the individual concerned. Personal data should be relevant to the purposes for which it is to be used, and, to the extent necessary for those purposes, should be accurate, complete, and up-to-date. We will protect personal information by reasonable security safeguards against loss or theft, as well as unauthorized access, disclosure, copying, use or modification. We will make readily available to customers information about our policies and practices relating to the management of personal information. We are committed to conducting our business in accordance with these principles in order to ensure that the confidentiality of personal information is protected and maintained.\n\nAttributions for Blips:\n\nStar icon\nhttp://thenounproject.com/term/star/21442/\n\nRecent clock icon\nhttp://thenounproject.com/term/clock/27031/\n\nClose button icon\nhttp://thenounproject.com/term/close/8560/\n\nPlay button used on website\nhttp://thenounproject.com/term/play/8304/";

/** Feedback */
"AFBlipFeedbackTitle"                           = "Feedback";
"AFBlipFeedbackEmail"                           = "feedback@blipsapp.ca";
"AFBlipFeedbackDefaultMessage"                  = "Display Name: %@\nApp Version: %@\nDevice ID: %@\n\nIssue: \n\nComments: \n\n";
"AFBlipFeedbackMessage"                         = "Thank you for sending your feedback to the Blips team!";
"AFBlipFeedbackFailureMessage"                  = "It looks like something went wrong while trying to send that email, please try again.";

/** Timeline */
"AFBlipTimelineErrorUnableToLoadTimeline"       = "Oh no, we couldn't load this timeline.";
"AFBlipTimelineEmptyNoVideosFoundRecent"        = "It looks like you have no Blips! You can press the video icon to create a new Blip!";
"AFBlipTimelineEmptyNoVideosFoundAllRecent"     = "It looks like no Blips have been shared with you! You can press the friends icon to interact with friends and create your own Blips!";
"AFBlipTimelineEmptyNoVideosFoundFavourites"    = "It looks like you have no favourite Blips! You can press the favourite icon on a Blip to favourite it!";

"AFBlipTimelineDeleteVideoAlertViewTitle"       = "Remove Blip";
"AFBlipTimelineDeleteVideoAlertViewMessage"     = "Are you sure you want to remove this Blip from your timeline?";

/** Remove friend modal */
"AFBlipRemoveFriendModalTitle"                  = "Remove friend";
"AFBlipRemoveFriendModalMessage"                = "Are you sure you want to remove %@ from your friends list?";
"AFBlipRemoveFriendModalMessageFailure"         = "Something went wrong trying to remove your friend!";
"AFBlipRemoveFriendModalNo"                     = "No";
"AFBlipRemoveFriendModalYes"                    = "Yes";

/** Video views */
//Navigation
"AFBlipVideoViewBackButtonTitle"                = "Back";
"AFBlipVideoViewCancelButtonTitle"              = "Cancel";
"AFBlipVideoViewNextButtonTitle"                = "Next";
"AFBlipVideoViewDoneButtonTitle"                = "Done";
"AFBlipVideoViewReBlipButtonTitle"              = "Re-Blip";
"AFBlipVideoViewShareButtonTitle"               = "Send";

"AFBlipVideoViewShareNavTitle"                  = "Share Blip";
"AFBlipVideoViewCaptureNavTitle"                = "Capture Blip";
"AFBlipVideoViewFilterNavTitle"                 = "Add a filter";
"AFBlipVideoViewFilterTitle"                    = "Filters";
"AFBlipVideoViewCaptureTitle"                   = "Capture";

//Share screen
"AFBlipVideoViewShareMessageTitle"              = "Message";
"AFBlipVideoViewShareMessagePlaceholder"        = "You can write a message here...";

//Reset Password
"AFBlipSignInResetPasswordText"                 = "Forgot your password?";
"AFBlipSignInResetPasswordAlertText"            = "Please enter the email address you used to sign up.";
"AFBlipSignInResetPasswordAlertTitle"           = "Reset Password";
"AFBlipSignInResetPasswordAlertButtonReset"     = "Reset";
